app/controllers/admin/rake_loads_controller.rb

SELECT `rake_loads`.* FROM `rake_loads` WHERE (`rake_loads`.`arrival_date` <= '2019-02-27' AND `rake_loads`.`release_date` = '2019-02-27' AND `rake_loads`.`rakeform_otherform` = 'R')
---
  def new

    data = params[:data].to_date if params[:data].present?
    data = Date.today if data.blank?
    # => (lessthan-lt, greater-gt equal-eq)
    @rake_loads = RakeLoad.where(RakeLoad.arel_table[:arrival_date].lteq(data).and(RakeLoad.arel_table[:release_date].eq(data).and(RakeLoad.arel_table[:rakeform_otherform].eq("R"))))